2024/Welcome_Letters-En/test.tex
% Created 2024-08-09 Fri 11:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{xcolor}
\usepackage{hyperref}
\usepackage{tocloft}
\author{Robert Alicea}
\date{\textit{<2023-09-15 Fri>}}
\title{Troubleshooting Doom Emacs Configuration}
\hypersetup{
 pdfauthor={Robert Alicea},
 pdftitle={Troubleshooting Doom Emacs Configuration},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Issue Overview}
\label{sec:orgf599d74}
During the configuration of Doom Emacs, an error was encountered stating that the package \texttt{org-bullets} could not be found. This error prevented the successful loading of the Emacs configuration.

\section{Error Message}
\label{sec:org2f01dcb}
The specific error message received was:
\begin{quote}
(file-missing Cannot open load file No such file or directory org-bullets)
\end{quote}

\section{Troubleshooting Steps}
\label{sec:org448c85f}
To resolve the issue, the following steps were taken:

\begin{enumerate}
\item \textbf{\textbf{Ensure the package is listed in \texttt{packages.el}}}
Verify that \texttt{org-bullets} is included in the \texttt{packages.el} file.
\begin{itemize}
\item Open \texttt{packages.el} located in \texttt{\textasciitilde{}/.doom.d/} or \texttt{/home/rob/.dotfiles/.config/doom/}.
\item Add the following line if it's not already present:
\begin{minted}[breaklines=true,bgcolor=bg,fontsize=\footnotesize]{elisp}
(package! org-bullets)
\end{minted}
\end{itemize}

\item \textbf{\textbf{Sync Doom Emacs}}
After confirming the package is listed, run the sync command to install \texttt{org-bullets}.
\begin{itemize}
\item Execute the following command in the terminal:
\begin{minted}[breaklines=true,bgcolor=bg,fontsize=\footnotesize]{bash}
doom sync
\end{minted}
\end{itemize}

\item \textbf{\textbf{Restart Emacs}}
Once the sync is complete, restart Emacs to ensure the package is loaded properly.

\item \textbf{\textbf{Verify Configuration}}
Ensure that \texttt{org-bullets} is correctly referenced in \texttt{config.el}.
\begin{itemize}
\item The relevant configuration should look like this:
\begin{minted}[breaklines=true,bgcolor=bg,fontsize=\footnotesize]{elisp}
(use-package! org-bullets
  :hook (org-mode . org-bullets-mode)
  :config
  (setq org-bullets-bullet-list '("◉" "○" "●" "◆" "▶")))
\end{minted}
\end{itemize}
\end{enumerate}

\section{Outcome}
\label{sec:org91c0c9a}
After completing these steps, the error was resolved, and Doom Emacs loaded successfully with all configurations applied.

\section{Additional Notes}
\label{sec:orgc43399a}
\begin{itemize}
\item The \texttt{yasnippet} message about no snippets found is informational and can be ignored if snippets are not needed.
\item The \texttt{ispell} process indicates that spell checking is set up and functioning correctly.
\end{itemize}
\end{document}
